axel
bash-completion
chromium-browser
filezilla
fonts-liberation
g++
git
golang
google-talkplugin
make
mysql-workbench
php5
python
python
python-software-properties
python3
ruby
rubygems
svn
vim
vlc

nodejs