brew "ack"
brew "ast-grep"
brew "atuin"
brew "autoconf"
brew "automake"
brew "awk"
brew "bash"
brew "bat"
brew "check-jsonschema"
brew "cmake"
brew "composer"
brew "coreutils"
brew "curl"
brew "defaultbrowser"
brew "difftastic"
brew "dust"
brew "efm-langserver"
brew "entr"
brew "fd"
brew "ffmpeg"
brew "fx"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "gopls"
brew "grep"
brew "hyperfine"
brew "imagemagick"
brew "ipython"
brew "jq"
brew "just"
brew "lua"
brew "lua-language-server"
brew "make"
brew "mariadb", restart_service: :changed
brew "mosh"
brew "neovim"
brew "oha"
brew "parallel"
brew "php"
brew "pure"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "rsync"
brew "rust-analyzer"
brew "stylua"
brew "subversion"
brew "telnet"
brew "tmux"
brew "tree"
brew "tree-sitter-cli"
brew "uv"
brew "volta"
brew "wp-cli"
brew "zig"
brew "zizmor"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
cask "alfred"
cask "codex"
cask "ghostty"
cask "orbstack"
cask "rectangle"
cask "font-monaspace"
cask "font-jetbrains-mono-nerd-font"
cask "font-dejavu-sans-mono-nerd-font"
# Brings the power of Copilot coding agent directly to your terminal
cask "copilot-cli"
# Open-source keystroke visualiser
cask "keycastr"
# Multimedia player
cask "vlc"
# Utility for comparing and merging files and directories
cask "kdiff3"
# PAM module for reattaching to the user's GUI (Aqua) session
brew "pam-reattach"
# PNG file optimizer
brew "optipng"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Incredibly fast JavaScript runtime, bundler, test runner, and package manager
brew "bun"
